---
kind: method
id: M:Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution.#ctor(Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution)
source: html/6c72b2a2-38b8-45d5-2e05-e836a222293b.htm
---
# Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution.#ctor Method

Creates a copy of the given photometric web light distribution

## Syntax (C#)
```csharp
public PhotometricWebLightDistribution(
	PhotometricWebLightDistribution other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null